In [1]:
#drop target variables to create X and turn X features categorical 
#split the data into train and test set
#import the random forest classifier with parameters "no of estimators =10", "max_features = 'auto'" and "random_state = 101"
#fit the data and make predictions
#import the confusion matrix and classification report

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [44]:
df = pd.read_csv(r"C:\Users\chukw\Downloads\ML, AI\Udemy ML\data\penguins_size.csv")
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [4]:
df.isnull().sum()

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [8]:
df[df["sex"].isnull()]

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [45]:
index = [3,339]
df = df.drop(index, axis =0)

In [46]:
df[df["sex"].isnull()]

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN

In [20]:
df[df["species"] == "Gentoo"].groupby(["sex"]).describe().transpose()

sex                           .       FEMALE         MALE
culmen_length_mm  count     1.0    58.000000    61.000000
                  mean     44.5    45.563793    49.473770
                  std       NaN     2.051247     2.720594
                  min      44.5    40.900000    44.400000
                  25%      44.5    43.850000    48.100000
                  50%      44.5    45.500000    49.500000
                  75%      44.5    46.875000    50.500000
                  max      44.5    50.500000    59.600000
culmen_depth_mm   count     1.0    58.000000    61.000000
                  mean     15.7    14.237931    15.718033
                  std       NaN     0.540249     0.741060
                  min      15.7    13.100000    14.100000
                  25%      15.7    13.800000    15.200000
                  50%      15.7    14.250000    15.700000
                  75%      15.7    14.600000    16.100000
                  max      15.7    15.500000    17.300000
flipper_length_mm count     1.0    58.000000    61.000000
                  mean    217.0   212.706897   221.540984
                  std       NaN     3.897856     5.673252
                  min     217.0   203.000000   208.000000
                  25%     217.0   210.000000   218.000000
                  50%     217.0   212.000000   221.000000
                  75%     217.0   215.000000   225.000000
                  max     217.0   222.000000   231.000000
body_mass_g       count     1.0    58.000000    61.000000
                  mean   4875.0  4679.741379  5484.836066
                  std       NaN   281.578294   313.158596
                  min    4875.0  3950.000000  4750.000000
                  25%    4875.0  4462.500000  5300.000000
                  50%    4875.0  4700.000000  5500.000000
                  75%    4875.0  4875.000000  5700.000000
                  max    4875.0  5200.000000  6300.000000

In [17]:
df[df["sex"] == '.']

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
336,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,.

In [18]:
len(df)

342

In [50]:
df[(df["species"] == "Gentoo") & (df["sex"].isnull())].fillna("FEMALE")

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,FEMALE
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,FEMALE
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,FEMALE

In [51]:
df[df["sex"].isnull()]

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN

In [52]:
df.loc[(df["species"] == "Gentoo") & (df["sex"].isnull()), "sex"] = df["sex"].fillna("FEMALE")

In [61]:
df[df["sex"].isnull()]

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN

In [54]:
df[df["species"] == "Adelie"].groupby(["sex"]).describe().transpose()

sex                           FEMALE         MALE
culmen_length_mm  count    73.000000    73.000000
                  mean     37.257534    40.390411
                  std       2.028883     2.277131
                  min      32.100000    34.600000
                  25%      35.900000    39.000000
                  50%      37.000000    40.600000
                  75%      38.800000    41.500000
                  max      42.200000    46.000000
culmen_depth_mm   count    73.000000    73.000000
                  mean     17.621918    19.072603
                  std       0.942993     1.018886
                  min      15.500000    17.000000
                  25%      17.000000    18.500000
                  50%      17.600000    18.900000
                  75%      18.300000    19.600000
                  max      20.700000    21.500000
flipper_length_mm count    73.000000    73.000000
                  mean    187.794521   192.410959
                  std       5.595035     6.599317
                  min     172.000000   178.000000
                  25%     185.000000   189.000000
                  50%     188.000000   193.000000
                  75%     191.000000   197.000000
                  max     202.000000   210.000000
body_mass_g       count    73.000000    73.000000
                  mean   3368.835616  4043.493151
                  std     269.380102   346.811553
                  min    2850.000000  3325.000000
                  25%    3175.000000  3800.000000
                  50%    3400.000000  4000.000000
                  75%    3550.000000  4300.000000
                  max    3900.000000  4775.000000

In [71]:
df.loc[9, "sex"] = "FEMALE" if pd.isna(df.loc[9, "sex"]) else df.loc[9, "sex"]
df.loc[11, "sex"] = "FEMALE" if pd.isna(df.loc[11, "sex"]) else df.loc[11, "sex"]

In [73]:
df.loc[(df["species"] == "Adelie") & (df["sex"].isnull()), "sex"] = df["sex"].fillna("FEMALE")

In [74]:
df[df["sex"].isnull()]

Empty DataFrame
Columns: [species, island, culmen_length_mm, culmen_depth_mm, flipper_length_mm, body_mass_g, sex]
Index: []

In [81]:
df.at[336,"sex"] = 'FEMALE'

In [82]:
df[df["sex"] == "."]

Empty DataFrame
Columns: [species, island, culmen_length_mm, culmen_depth_mm, flipper_length_mm, body_mass_g, sex]
Index: []

In [109]:
X = df.drop("sex",axis = 1)
X

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0
...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0

In [88]:
y = df['sex']
y

0        MALE
1      FEMALE
2      FEMALE
4      FEMALE
5        MALE
        ...
338    FEMALE
340    FEMALE
341      MALE
342    FEMALE
343      MALE
Name: sex, Length: 342, dtype: object

In [89]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.25, random_state = 101)

In [110]:
X = pd.get_dummies(df.drop("species",axis = 1), drop_first = True)

### Base Model

In [111]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators =10, max_features = 'sqrt',random_state = 101 )

In [112]:
rfc.fit(X_train,y_train)
base_preds = rfc.predict(X_test)

ValueError: could not convert string to float: 'Gentoo'

In [107]:
X

,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,species_Chinstrap,species_Gentoo,island_Dream,island_Torgersen
0,39.1,18.7,181.0,3750.0,0,0,0,1
1,39.5,17.4,186.0,3800.0,0,0,0,1
2,40.3,18.0,195.0,3250.0,0,0,0,1
4,36.7,19.3,193.0,3450.0,0,0,0,1
5,39.3,20.6,190.0,3650.0,0,0,0,1
...,...,...,...,...,...,...,...,...
338,47.2,13.7,214.0,4925.0,0,1,0,0
340,46.8,14.3,215.0,4850.0,0,1,0,0
341,50.4,15.7,222.0,5750.0,0,1,0,0
342,45.2,14.8,212.0,5200.0,0,1,0,0
343,49.9,16.1,213.0,5400.0,0,1,0,0

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            342 non-null    object
 1   island             342 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                342 non-null    object
dtypes: float64(4), object(3)
memory usage: 29.5+ KB